<template>
	<view class="page">
		
		使用条款
		使用iherb 须遵守下列条款与条件。
		
		iherb属TopCashback (USA) Inc.（下称“我们”） 所有并由其运营。
		
		作为用户的您（下称“您”）进入我们的网站或注册为会员，即表示接受我们的条款与条件。
		
		1. 网站会员资格与账户的关停。每个人可以开立一个账户。
		iherb针对中国消费者，只能通过银行卡、PayPal和Amazon美国亚马逊礼品卡提取返利。
		
		会员只能在获得商户认可并且在我们收到购物返现后才能得到相应的返利。
		
		使用TopCashback网站基于这样的假设，即已获得所有相关各方的完整授权。此类相关各方可能包括但不限于雇主、朋友、家人和企业。
		
		会员应该考虑从其他国家、州或州内其他地方接收物品而需要承担的合法性，并负责支付关税（或其他类似的相关税收）及任何其他费用。
		
		我们保留拒绝给予会员资格的权利，更保留在我们认为有诈骗、滥用或其他不公平行为时关停账户的权利。此外谨记一点：被认定为休眠的账户可能被停用，详见第五条的概述。
		
		如果您是点击朋友发送的邀请好友链接加入的，邀请人（您的朋友）就可能看到您有没有达到让他们获得邀请奖金所需的最低返利限额。他们还可以看到您的注册日期及用户名。
		
		作为注册会员的条件之一，您必须接受TopCashback发出的服务邮件，并验证您的电子邮件地址。谨记：您将同时注册接收我们发出的电子邮件，包括周期性发送的返利优惠信息、我们的博客更新、以及与我们网站和服务有关的其他电子邮件。您可以在账户设置页面退订这些邮件。
		
		如果会员拒不提供可用的电子邮件地址，或者将我们的电子邮件标记为辱骂邮件、垃圾邮件或广告邮件，我们保留关停其会员账户的权利。
		
		2. 注册奖励
		新会员在注册TopCashback中文站（iherb）账户时如输入了博主推荐注册码， 我们的系统将会验证注册码的有效性：如真实有效，注册奖励将会在注册后24小时内显示于您的账户“待返利”中；如注册码无效，您将无法得到注册奖励。
		
		注册奖励在您的第一笔交易返利可提现后即“可提现”。
		
		若您在注册之日起的3个月内未下单成功获得返利，注册奖励将自动失效。
		
		所有博主推荐注册码有效期以实际情况为准，请按宣传规则注册使用。
		
		博主推荐注册码不能和邀请好友链接同时使用。
		
		3. 返利奖励
		作为TopCashback注册会员，您有可能从我们网站上所列各家商户获得“返利”或相应的返现奖励。谨记：您每笔交易的对象都是某个零售商，而不是我们。
		
		我们将从商家和他们的追踪机构获得适用于您交易的返利返回给您，适用于您交易的返利是指当该款项可通过在商户及其追踪机构的报告中提供可识别标签，直接追溯到您的账户。
		
		商户可能不时增加或减少支付的佣金，因此我们的网站上显示的返现金额可能并不准确。我们尽合理的关注和所能，保证本网站提供的数据准确且最新，但不担保本网站任何信息的准确性。对于任何错误或疏漏，以及由此导致的任何损害或损失都不承担任何责任。而且，我们会尽合理的关注和所能，保证网站的正常运行，但不保证它的功能，对任何错误都概不负责。默认情况下，将根据零售商报告给我们的佣金数目，将适用于您交易的金额入账。该金额可能高于或低于网站上公布的数目。有些零售商就客户购买金额返现时一并计入相关税费和/或运输费，有些零售商为便于计算和返现不计此类费用。
		
		当我们查询到有适用于您交易的返利时，将向您该笔交易的状态显示为“待返利”。待零售商确认交易有效后，状态会被标记为“已确认”，这个过程可能需要30天或更长时间（从购买日算起）。如果发生退货，或交易被以任何方式取消或改变，则返利会被取消。
		
		适用返利交易是指满足下列标准的交易：
		
		a. 在商户和/或其追踪网络提供给我们的报告中，可以通过识别标签直接追踪到您的账户的交易。请注意，在点击进入商户网站之前必须登录本网站账户，以便通过识别标签追踪您的交易。但我们将采取合理的措施，在您尚未登录TopCashback账户即点击进入商户网站时发出警示。
		
		b. 您还必须点击本网站上面的“去购物”主按钮或“去购物 拿返利”按钮，进入商户的网站。点击本网站上的赞助广告不能获得佣金或返利。我们将尽力明确标记赞助广告链接，以免您错误点击相关链接而丧失返利机会。
		
		c. 有些重复购买也可能无法获得返利，而且您的购买必须真实有效。您必须在TopCashback网站直接点击进入有意购物的商户网站（不能通过任何其他第三方网站）之后完成交易，随后必须立即完成整个在线购物流程。
		
		d. 您的账户因为任何原因而被关停或停用，那么您的返利将被没收，如有其他将来可能转换成返利的交易，也将不被定为适用有效交易。
		
		谨记：从TopCashback网站点击进入商户的网站即刻直接完成购物，可以使多次交易获得返利的机率最大化。
		
		如果商户未向我们报告与您相关的任何销售交易，我们不负任何责任。对于何为真正的交易，商户有自己的规定。例如，只想通过点击/注册来获得返利而无意继续使用/从其网站购物，就可能被认定为非真实交易。我们或商户可能会（也可能不会）公布这些规定，而由我们或商户自行斟酌处理。
		
		如果您与多个TopCashback账户有关联（例如夫妻账户），作为反欺诈使用率防控，允许的重复交易数量会在这些账户中累计计算。
		
		虽然我们将尽力向零售商追回未付返现，但我们将以TopCashback网站、零售商或其追踪机构的决策为最终决定。虽然我们将尝试追回失踪的返现，但在任何时候都保留不予追讨失踪返利索赔的权利，尤其是并无购物的时候。
		
		即使商户成功支付了返利索赔，您收到的金额也可能低于预期金额，因为我们收到的金额就可能低于初始索赔金额。我们的确允许您就此提出质询索赔。若六个月后商户依然没有支付人工返利索赔款，我们保留结束质询索赔的权利。
		
		认定有可能存在任何错误返利的，TopCashback保留追回或相应调整余额的权利。这包括但不限于下列交易，即返利不真实、或尚未收到商户或其代理商的任何交易佣金付款。可能包括您的TopCashback账户中标记的可提现，或已通过直接转账、PayPal或任何其他方式付款给您的交易项。TopCashback保留采取它认为合适的防诈骗措施的权利。
		
		TopCashback及其广告商保留依据交易价值/所购合约限制返利上限的权利。
		
		要获得邀请奖励，被邀请的会员必须满足一定的标准，例如本网站邀请好友部分详细描述的最低提现金额，并排除某些商户或交易类型。只有真实注册的邀请才可以获得邀请奖励。
		
		通过商业手段获得的邀请奖励（包括但不限于比较网站）以每次不高于5美元为限，且设有最低提现金额，不管账户持有人是否收到标出更高“消费者会员”邀请好友奖励的服务邮件，经我方以书面方式签字明确同意的除外。对于任何试图规避本政策或以欺诈行为违反本政策的商业机构，我们可能向它们发出通知，即时终止双方的合作关系。同一个人创建并使用几个账户或有任何欺诈性注册的，将被关停账户。我们可能随时调整邀请好友最低提现金额的标准。在发送任何邀请之前，请阅读“邀请好友”部分的使用条款。
		
		TopCashback自己或其他会员在TopCashback网站上发布优惠码（又称为折扣码、优惠券代码或其他类似名称），TopCashback对优惠码的有效性不负有任何责任。不能在完成交易后使用并获得优惠码提供的优惠。
		
		此外，对于使用优惠码后所造成的其它任何返利损失、或损失任何其他本来可以获得的利益，TopCashback都概不负责。
		
		为免生歧义，即使本协议或网站有任何不同规定，您同意在任何情形下，我们均可全权酌处返利付款事宜，而且我们可以出于任何原因，包括但不限于商户拒不返利或逾期付款，而拒绝向您返利付款。
		
		4. 返利提现计划
		返利提现将会根据您的要求受理。账户中有任何“可提现”返利时，都可以要求返利提现。返利提现后，要过一小段时间后才能要求安排下一次提现。
		
		我们收到的佣金付款将作为我们的资金由我们保管，直至作为返利支付给会员。
		
		因零售商延期付款或停止交易的，我们将尽合理所能追回您的返利，但在收到零售商或其代理人的款项之前，我们不能保证一定会支付返利。
		
		各种提现方式可能会有调整，我们有权对此设限制。您必须自行准确保管提现凭证，以免错过任何到期支付款项。发错的付款不一定能追回，还可能需要缴纳追款服务费。对于任何付款延误或延误造成的后果，我们概不负责。在任何时候，我们都保留滞留返利并等候调查结果的权利，例如，当我们发现账户活动异常，因此要求提供相关信息验证以确定交易的真实性时就会这样处理。
		
		您有责任对返利付款完税。
		
		5.休眠账户
		为使我们的行政管理消耗最小化，或出于任何其他原因，我们保留关停休眠账户的权利。为保持账户的活跃性，并保证不被标记为休眠账户，我们不要求进行购买交易，但是要求您至少每六个月登录账户一次。
		
		6. 协议的变更
		我们可能出于任何原因，随时自行修订本协议所含的任何条款与条件。我们将在本网站公布修订后的协议。新条款将在修订后30天内生效。
		
		7. 杂项
		我们没有强制您严格执行本协议的任何规定，但并不构成我方放弃后续强制您执行此类规定或本协议任何其他规定的权利。
		
		8. 我们的隐私政策
		我们的隐私政策准确概述了我们如何处理您的账户信息，以及为保护您的隐私而采取的措施。
		
		9.著作权： iherb 受著作权法的保护。本网站全部或部分仅供您个人使用。您不得复制或提供修订前后的本网站任何部分内容，供您个人私下使用的除外。未经我们明确的书面同意，您不得复制或提供本网站所含的任何数据。未经TopCashback (USA) Inc.明确的书面同意，您不得发布或出于商业目的开发利用本网站。我们保留所有其他权利。
		
		10. 来自外部网站的链接： iherb 允许其他网站设置链接指向我们，但不允许将我们的页面加载入其他网站的框架中，不允许那些可能包含被视为冒犯性内容的任何网站设置链接指向我们。
		
		11. 指向外部网站的链接
		iherb 设置了链接指向许多其他网站，为用户提供相关信息和服务。外部网站不受我们控制，我们不对任何链接网站的内容负责。列出其他网站或链接至其他网站，并不表示对此类网站的任何类型的认可，也不就其内容承担任何责任。我们不保证此类链接始终有效，也无法掌控链接页面的可用性。如您认为有任何不当或冒犯性链接，或发现任何链接失效，请通知我们便于我们移除链接。
		
		12. 未经授权使用我们的网站
		如果发现TopCashback网站受到任何方式的篡改（包括修改网址、在公共媒体上发布未经授权的网址、页面被读取、伪装电子邮件、自动脚本、或我们自行认为属于异常使用的任何其他行为），我们可能会关停您的账户，并可能没收您在TopCashback网站的任何账户金额。
		
		为保护商户的利益，涉嫌滥用优惠的行为都可能导致交易被撤销。任何可疑交易可能需要经我们和/或相关商户验证，可能向您索要与您的交易有关的后续信息。为此，我们可能在与商户及其代理人的沟通中，转交您提供的任何信息。不得使用冒犯性用户名，用户名的使用不得侵犯TopCashback (USA) Inc.或其他机构拥有的任何商标或品牌名称，否则必须选择其他合适的用户名。
		
		不得在 iherb 或外部网站中假冒TopCashback。发现有会员假冒TopCashback并因此误导其他会员的，将采取相应的措施并可能关停涉事账户。
		
		13. 有关病毒的免责声明
		我们尽合理所能在发布内容之前先行测试。在使用本网站提供的内容时，如果在极其罕见的情况下，您的数据或计算机系统可能遭受任何损失、破坏或损害，我们也概不负责。
		
		14. 免责声明
		我们以“中立”形式提供 iherb 网站，并未提供任何代言或认可，以及任何类型的任何明示或默示担保，包括但不限于满意的质量、可达成某方面的健康、并无侵权、兼容性、安全性和准确性方面的默示担保。
		
		我们不保证本网站所含内容及功能不会中断或没有错误，不保证会纠正缺陷，不保证本网站或其托管服务器不含病毒或具有相关内容的全部功能、准确性或可靠性。
		
		在任何情形下，因为使用 iherb 或与之相关的原因，使用或无法使用相关数据或收益，进而导致的任何性质的损失或损害，包括但不限于间接性或相应后续性损失或损害，我们都概不负责。
		
		此类条款与条件受英格兰法律约束。英格兰法院对此类条款与条件项下的任何争议享有排他性管辖权。您在此同意：因为使用本网站而产生或与之相关的所有争议，均受英国法院的排他性管辖。在不允许此类条款与条件的所有规定生效的任何司法管辖区使用本网站都属于未经授权的行为，包括但不限于本款规定。
		
		如果根据适用的法律认定本协议的任何部分无效或不可执行，包括但不限于上述担保、免责声明和责任限制，应该视为与初始规定的本意极为接近的有效且可执行规定取代了此类无效或不可执行部分，协议的其他部分应该继续有效。
		
		 
	</view>
	<!-- <view class="page">
		<view class="feedback-type">
			<view class="title">
				<text>{{TypeArray[TypeIndex]}}</text>
			</view>
			<view class="picker">
				<picker @change="FeedbackTypeCh" :value="TypeIndex" :range="TypeArray">
						<view class="uni-input">{{TypeArray[TypeIndex]}}</view>
				</picker>
			</view>
			<view class="more">
				<text class="iconfont icon-more1"></text>
			</view>
		</view>
		<view class="feedback-data">
			<view class="content">
				<textarea value="" placeholder="请输入反馈的内容" />
			</view>
			<view class="voucher-img">
				<view class="list">
					<image src="/static/voucher_bg.png"></image>
				</view>
				<view class="list">
					<image src="/static/img/yf_01.png"></image>
				</view>
				<view class="list">
					<image src="/static/img/yf_01.png"></image>
				</view>
			</view>
		</view>
		<view class="contact-way">
			<input type="text" placeholder="手机/邮箱/QQ">
		</view>
		<view class="submit-btn">
			<text>提交</text>
		</view>
	</view> -->
</template>

<script>
	export default {
		data() {
			return {
				TypeArray: ['商品相关', '物流状况', '客户服务', '优惠活动','产品体验','产品功能','其他问题'],
				TypeIndex: 0,
			};
		},
		methods:{
			/**
			 * 反馈类型
			 * @param {Object} val
			 */
			FeedbackTypeCh(val){
				console.log(val);
				this.TypeIndex = val.detail.value;
			}
		}
	}
</script>

<style scoped lang="scss">
	@import 'Feedback.scss';
</style>
